package com.wlanl.wx.utils;

/**
 * @author wlanL
 */
public class RandomMessageUtils {
    /**
     * 早晨关怀语
     */
    public static final String [] CARE_MORNING_MESSAGES = {
            "宝贝要多喝水,按时吃饭喔~",
            "宝贝,上班到休息时间就休息一会儿~",
            "我给不了你世界上最好的一切,可是我一定会把我最好的一切都给你。早安!",
            "我一见到你,我就变得不像我自己。早安!",
            "哪有什么四季,遇见你,四季如春。早安!",
            "我想说的话都不知道怎么表达,爱总是藏在眼睛里,你却不知道也藏在这句话句首,早安!",
            "早安，亲爱的!你昨天晚上马不停蹄地在我脑海里跑了一整夜,可真辛苦,哼",
            "早上醒来笑一笑，美好心情围你绕，健康早餐健康在，上班路上蹦蹦跳，每天拥有好心情，健康长寿春永葆。"
    };

    /**
     * 下雨关怀
     */
    public static final String [] RAIN_MESSAGE = {
            "听说明天有雨,宝贝儿你可要,做好防雨准备啊,要穿厚点,带上雨伞嗷~",
            "很想问一句你有没有带伞,可是我忍住了,因为我怕你说没带,而我又无能为力,就像我爱你却得不到你想要的陪伴。最后，提醒你今天可能有雨喔! ",
            "如果是异地恋，不方便直接送伞的话，可以发信息说：“今天看天气你那下雨了，自己略微多添点衣服，别光臭美而感冒了!",
            "阴天，不一定会下雨；下雨，不一定是郁闷。平常心，买得起，爱不释手，下雨天心情依旧阳光。",
            "小雨淅沥，沁人心意。大雨倾盆，快乐进门。暴雨如注，幸福入户。愿你雨天心情好，烦恼被风刮跑，忧愁被雨冲掉。健康向你报到，平安和你拥抱！",
            "祝福是一把伞，它能伴你走过阴雨天。一条留言，一份祝福，让你欢快每一天！祝你双休欢快！下雨天的爱情祝福语。",
            "下雨了，气温骤降，但也无法阻止一些人强烈的臭美欲望，最后针扎在屁股上，你想不想和他们一样！不想，那要多穿衣, 关爱屁股！人人有责！",
            "大雨荡涤尘埃，空气清新。暴雨冲刷污浊，大地清洁。不管大雨暴雨，希望你雨天快乐。风大雨急，我的祝福问候不间离，愿你雨天和晴天一样幸福如意！"
    };

    /**
     * 天气冷关怀
     */
    public static final String [] CODE_MESSAGE = {
            "亲爱的,多穿点衣服,要降温了,小心着凉啊,打针是很疼的嗷~",
            "天气转寒，传递温暖;注意保暖，预防感冒;一日三餐，膳食合理;坚持锻炼，身健体康;减少熬夜，充足精力;抛弃烦恼，保持轻松;心情愉快，生活甜蜜~",
            "天冷了，该添衣服的添衣服，不管你们怎么样，都好好的。虽异地，必重逢~",
    };

    public static final String [] AMB_MESSAGE = {
            "我写了万句情话，行行是你，不如一句余生是你~",
            "从今以后，风筝有风，海豚有海，你有我~",
            "这个世界乱糟糟的，而你干干净净，可以悬在我的心上，作太阳和月亮~",
            "遇见你是故事的开始，走到底是余生的欢喜~",
            "我喜欢你，是那种一想到你的名字，心里动辄海啸山鸣的喜欢~",
            "有一个喜欢的人真是太好了，在我的世界正在崩塌的时候还是想为了你努力一把~",
            "我希望压得你喘不过气的不是生活，而是我~",
            "你是我最光明的秘密，也是我从不曾拥有的底气~",
            "我不是无人可爱，我是非你不可~",
    };
}
